Revit 2027 API
ElementSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As ElementSetIterator
public:
virtual ElementSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ElementSetIterator
override ReverseIterator : unit -> ElementSetIterator
Return Value
ElementSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace